export const INGREDIENT_MAP = {
  1: {
    id: 1,
    name: '비타민 A',
  },
  2: {
    id: 2,
    name: '비타민 D',
  },
  3: {
    id: 3,
    name: '비타민 E',
  },
  4: {
    id: 4,
    name: '비타민 K',
  },
  5: {
    id: 5,
    name: '비타민 B1 (티아민)',
  },
  6: {
    id: 6,
    name: '비타민 B2 (리보플라빈)',
  },
  7: {
    id: 7,
    name: '비타민 B3 (나이아신)',
  },
  8: {
    id: 8,
    name: '비타민 B5 (판토텐산)',
  },
  9: {
    id: 9,
    name: '비타민 B6 (피리독신)',
  },
  10: {
    id: 10,
    name: '비타민 B9 (엽산)',
  },
  11: {
    id: 11,
    name: '비타민 B7 (비오틴)',
  },
  12: {
    id: 12,
    name: '비타민 B12 (코발아민)',
  },
  13: {
    id: 13,
    name: '비타민 C',
  },
  14: {
    id: 14,
    name: '칼슘',
  },
  15: {
    id: 15,
    name: '마그네슘',
  },
  16: {
    id: 16,
    name: '철',
  },
  17: {
    id: 17,
    name: '아연',
  },
  18: {
    id: 18,
    name: '구리',
  },
  19: {
    id: 19,
    name: '셀레늄',
  },
  20: {
    id: 20,
    name: '요오드',
  },
  21: {
    id: 21,
    name: '망간',
  },
  22: {
    id: 22,
    name: '몰리브덴',
  },
  23: {
    id: 23,
    name: '칼륨',
  },
  24: {
    id: 24,
    name: '크롬',
  },
  25: {
    id: 25,
    name: '오메가-3 (EPA, DHA)',
  },
  26: {
    id: 26,
    name: '아르기닌',
  },
  27: {
    id: 27,
    name: '코엔자임 Q10',
  },
  28: {
    id: 28,
    name: '루테인',
  },
  29: {
    id: 29,
    name: '가르시니아 캄보지아 (HCA)',
  },
  30: {
    id: 30,
    name: '공액리놀레산 (CLA)',
  },
  31: {
    id: 31,
    name: '홍삼',
  },
  32: {
    id: 32,
    name: 'BCAA',
  },
  33: {
    id: 33,
    name: '콜라겐',
  },
  34: {
    id: 34,
    name: '타우린',
  },
  35: {
    id: 35,
    name: '크레아틴',
  },
  36: {
    id: 36,
    name: '스피룰리나',
  },
  37: {
    id: 37,
    name: '크렌베리추출물',
  },
};
